<?php

return [
    'label' => [
        'store' => 'Метка успешно создана',
        'update' => 'Метка успешно изменена',
        'destroy' => [
            'success' => 'Метка успешно удалена',
            'fail' => 'Не удалось удалить метку',
        ],
    ],
    'task_status' => [
        'store' => 'Статус успешно создан',
        'update' => 'Статус успешно изменён',
        'destroy' => [
            'success' => 'Статус успешно удалён',
            'fail' => 'Не удалось удалить статус',
        ],
    ],
    'task' => [
        'store' => 'Задача успешно создана',
        'update' => 'Задача успешно изменена',
        'destroy' => [
            'success' => 'Задача успешно удалена',
            'fail' => 'Не удалось удалить задачу',
        ],
    ],
];
