<?php

return [

    'title' => 'Менеджер задач',


    'menu' => [
        'items' => [
            'main' => 'Главная',
            'tasks' => 'Задачи',
            'task_statuses' => 'Статусы',
            'labels' => 'Метки'
        ],
        'profile' => [
            'login' => 'Войти',
            'register' => 'Регистрация',
            'profile' => 'Профиль',
            'logout' => 'Выход'
        ]
    ],


    'pages' => [
        'welcome' => [
            'h1' => 'Привет от Хекслета!',
            'p' => 'Это простой менеджер задач на Laravel'
        ],
    ],


    'label' => [
        'name' => 'Метка',
        'table' => [
            'id' => '#',
            'name' => 'Имя',
            'description' => 'Описание',
            'created_at' => 'Дата создания',
            'actions' => 'Действия',
        ],
        'pages' => [
            'index' => [
                'title' => 'Метки',
                'new' => 'Создать метку',
                'edit' => 'Изменить'
            ],
            'create' => [
                'title' => 'Создать метку',
                'submit' => 'Создать'
            ],
            'edit' => [
                'title' => 'Изменение метки',
                'submit' => 'Обновить'
            ]
        ],
        'modal' => [
            'delete' => 'Удалить',
            'sure' => 'Вы уверены ?',
            'will_be_deleted' => 'Будет удалена метка',
            'cancel' => 'Отмена',
            'ok' => 'OK'
        ],
        'flash' => [
            'store' => 'Метка успешно создана',
            'update' => 'Метка успешно изменена',
            'destroy' => [
                'success' => 'Метка успешно удалена',
                'fail' => 'Не удалось удалить метку',
            ],
        ],
    ],


    'task_status' => [
        'name' => 'Статус',
        'table' => [
            'id' => '#',
            'name' => 'Имя',
            'created_at' => 'Дата создания',
            'actions' => 'Действия',
        ],
        'pages' => [
            'index' => [
                'title' => 'Статусы',
                'new' => 'Создать статус',
                'edit' => 'Изменить'
            ],
            'create' => [
                'title' => 'Создать статус',
                'submit' => 'Создать'
            ],
            'edit' => [
                'title' => 'Изменение статуса',
                'submit' => 'Обновить'
            ],
        ],
        'modal' => [
            'delete' => 'Удалить',
            'sure' => 'Вы уверены ?',
            'will_be_deleted' => 'Будет удалён статус',
            'cancel' => 'Отмена',
            'ok' => 'OK'
        ],
        'flash' => [
            'store' => 'Статус успешно создан',
            'update' => 'Статус успешно изменён',
            'destroy' => [
                'success' => 'Статус успешно удалён',
                'fail' => 'Не удалось удалить статус',
            ]
        ]
    ],

    'task' => [
        'name' => 'Задача',
        'table' => [
            'id' => '#',
            'description' => 'Описание',
            'status' => 'Статус',
            'name' => 'Имя',
            'author' => 'Автор',
            'executor' => 'Исполнитель',
            'created_at' => 'Дата создания',
            'actions' => 'Действия',
            'labels' => 'Метки'
        ],
        'filter' => [
            'submit' => 'Применить'
        ],
        'pagination' => [
            'showing' => 'Показаны результаты',
            'from' => 'с',
            'to' => 'по',
            'of' => 'из',
        ],
        'pages' => [
            'index' => [
                'title' => 'Задачи',
                'new' => 'Создать задачу',
                'edit' => 'Изменить',
            ],
            'create' => [
                'title' => 'Создать задачу',
                'submit' => 'Создать'
            ],
            'edit' => [
                'title' => 'Изменение задачи',
                'submit' => 'Обновить'
            ],
            'show' => [
                'title' => 'Просмотр задачи',
                'submit' => 'Создать'
            ],
        ],
        'modal' => [
            'delete' => 'Удалить',
            'sure' => 'Вы уверены ?',
            'will_be_deleted' => 'Будет удалена задача',
            'cancel' => 'Отмена',
            'ok' => 'OK'
        ],
        'flash' => [
            'store' => 'Задача успешно создана',
            'update' => 'Задача успешно изменена',
            'destroy' => [
                'success' => 'Задача успешно удалена',
                'fail' => 'Не удалось удалить задачу',
            ]
        ]
    ]
];
