<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Flash Language Lines
    |--------------------------------------------------------------------------
    */

    'status' => [
        'created' => 'Статус успешно создан',
        'edited' => 'Статус успешно изменён',
        'deleted' => 'Статус успешно удалён',

        'not_deleted' => 'Не удалось удалить статус'
    ],
    'label' => [
        'created' => 'Метка успешно создана ',
        'edited' => 'Метка успешно изменена',
        'deleted' => 'Метка успешно удалена',

        'not_deleted' => 'Не удалось удалить метку'
    ],
    'task' => [
        'created' => 'Задача успешно создана ',
        'edited' => 'Задача успешно изменена',
        'deleted' => 'Задача успешно удалена',

        //'not_deleted' => 'Не удалось удалить задачу'
    ]

];
